Закупки/src/Documents/ВнутренниеЗаявки/ВнутренниеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутренниеЗаявки</name>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТоваров</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадоПриобрести</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
</mdclass:Document>

Закупки/src/Enums/СтатусЗаявки/СтатусЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаявки</name>
  <enumValues>
    <name>НеВЗаказе</name>
  </enumValues>
  <enumValues>
    <name>ВНеСогласованомЗаказе</name>
  </enumValues>
  <enumValues>
    <name>ВСогласованномЗаказе</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
</mdclass:Enum>

Закупки/src/Documents/ВнутренниеЗаявки/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ТоварПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварПриИзмененииНаСервере()
	Родитель = Объект.Товар.Родитель.Наименование;
	Объект.КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(Родитель);
	Объект.Цена = Объект.Товар.Цена;
	Объект.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
КонецПроцедуры



&НаКлиенте
Процедура ТекущееКоличествоПриИзменении(Элемент)
	Если ТекКоличествоДостаточно() Тогда
		Если ТекКоличествоМного() Тогда
			Ответ = Вопрос("Текущее количество товаров больше максимального. 
							|Вы уверены, что хотите создать заявку?", РежимДиалогаВопрос.ДаНетОтмена, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Закрыть();	
			КонецЕсли;		
		Иначе
			Ответ = Вопрос("Текущее количество товаров больше минимального. 
							|Вы уверены, что хотите создать заявку?", РежимДиалогаВопрос.ДаНетОтмена, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Закрыть();	
			Иначе
				ТекущееКоличествоПриИзмененииНаСервере();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущееКоличествоПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ТекущееКоличествоПриИзмененииНаСервере()
	Если Объект.Товар.МаксимальноеКоличество > Объект.ТекущееКоличество Тогда
		Объект.НадоПриобрести = Объект.Товар.МаксимальноеКоличество - Объект.ТекущееКоличество;
	КонецЕсли;
КонецПроцедуры


Функция ТекКоличествоДостаточно()
	Возврат Объект.ТекущееКоличество >= Объект.Товар.МинимальноеКоличество;
КонецФункции

Функция ТекКоличествоМного()
	Возврат Объект.ТекущееКоличество >= Объект.Товар.МаксимальноеКоличество;
КонецФункции
